Revit 2027 API
LinkedResourceOpeningEventArgs.ResourceType Property
 The desired linked resource type.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceType ResourceType { get; }
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
member ResourceType : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace